#ifndef CONTENTDESC_H_HEADER_INCLUDED_AAA56347
#define CONTENTDESC_H_HEADER_INCLUDED_AAA56347

#include "../Descriptor.h"

/* EIT 内容类型列表 */
const char* const eit_content_table[16][16] = 
{
    "",                 "",                             "",                  "",                  "",                   "",            "",              "",            "",         "",         "",              "",               "",     "",  "",  "",
    "电影/电视剧/戏剧", "侦探/恐怖",                    "冒险/战争",         "科幻",              "喜剧",               "肥皂剧",      "言情",          "古典/历史",   "",         "",         "",              "",               "",     "",  "",  "", 
    "新闻时事",         "新闻/天气预报",                "新闻杂志",          "资料",              "讨论/访谈/辩论",     "",            "",              "",            "",         "",         "",              "",               "",     "",  "",  "", 
    "表演/游戏",        "智力游戏/智力竞赛",            "杂技",              "脱口秀",            "",                   "",            "",              "",            "",         "",         "",              "",               "",     "",  "",  "", 
    "综合体育",         "特别节目（奥运会、世界杯等）", "体育杂志",          "足球/篮球/排球",    "乒乓球/羽毛球/网球", "团体性运动",  "田径",          "自行车/赛车", "水上运动", "冬季运动", "马术",          "武术/拳击/摔跤", "棋牌", "",  "",  "", 
    "青年少儿节目",     "幼儿节目",                     "少儿节目",          "青年节目",          "信息/教育",          "卡通/木偶戏", "",              "",            "",         "",         "",              "",               "",     "",  "",  "", 
    "音乐/舞蹈",        "流行",                         "严肃音乐/古典音乐", "民俗音乐/民族音乐", "爵士乐",             "歌舞剧/歌剧", "芭蕾舞",        "戏曲/曲艺",   "",         "",         "",              "",               "",     "",  "",  "", 
    "文化艺术",         "表演艺术",                     "高雅艺术",          "",                  "大众文化/传统艺术",  "文学",        "电影/电视文化", "",            "",         "新媒体",   "艺术/文化杂志", "时尚",           "",     "",  "",  "", 
    "社会/政治/经济",   "杂志/报道/资讯/证券",          "经济/社会咨询",     "名人专题",          "",                   "",            "",              "",            "",         "",         "",              "",               "",     "",  "",  "", 
    "教育/科学/专题",   "自然/动物/环境",               "技术/自然科学",     "医疗/生理/心理",    "探险",               "社会科学",    "继续教育",      "语言",        "",         "",         "",              "",               "",     "",  "",  "", 
    "休闲/业余爱好",    "旅游",                         "手工",              "车趣",              "健身",               "烹饪",        "广告/购物",     "园艺",        "",         "",         "",              "",               "",     "",  "",  "", 
    "",                 "",                             "",                  "",                  "",                   "",            "",              "",            "",         "",         "",              "",               "",     "",  "",  "",
    "",                 "",                             "",                  "",                  "",                   "",            "",              "",            "",         "",         "",              "",               "",     "",  "",  "",
    "",                 "",                             "",                  "",                  "",                   "",            "",              "",            "",         "",         "",              "",               "",     "",  "",  "",
    "",                 "",                             "",                  "",                  "",                   "",            "",              "",            "",         "",         "",              "",               "",     "",  "",  "",
    "",                 "",                             "",                  "",                  "",                   "",            "",              "",            "",         "",         "",              "",               "",     "",  "",  ""
};

//descriptor_tag = 0x54
//##ModelId=555AF24E007A
class ContentDesc : public Descriptor
{
  public:
    //##ModelId=555AF25A0195
    class ContentInfo
    {
      public:
        ContentInfo();
        ContentInfo(uint8_t* data);
        virtual ~ContentInfo();
        //##ModelId=555AF27201B5
        uint8_t content_nibble_level_1;
        //##ModelId=555AF294001C
        uint8_t content_nibble_level_2;
        //##ModelId=555AF2AC0196
        uint8_t user_nibble_1;
        //##ModelId=555AF2C90086
        uint8_t user_nibble_2;
    };

    //##ModelId=555AF3270376
    ContentDesc();

    //##ModelId=555AF32E0325
    ContentDesc(uint8_t* data);

    //##ModelId=555AF34201EF
    virtual ~ContentDesc();

    virtual void resolved();

    //##ModelId=555AF2F201E5
    std::list<ContentInfo*> content_list;
};



#endif /* CONTENTDESC_H_HEADER_INCLUDED_AAA56347 */
